app/controllers/users_controller.rb

  def show
    @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    if ( current_user != @user )
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 30]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "sharonA"], ["password_digest", "$2a$10$PDx3tZzIo2.eNPZPYDF8NuWgpZBOtsm.gVqL.NRfeB/5B4Nhb85G2"], ["updated_at", "2015-04-07 10:27:04.646161"], ["id", 7]]